Revit 2027 API
RebarContainer.IsItemHidden Method
 Identifies if a given RebarContainerItem is hidden in this view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsItemHidden(
	View view,
	int itemIndex
)
Public Function IsItemHidden (
	view As View,
	itemIndex As Integer
) As Boolean
public:
bool IsItemHidden(
	View^ view,
	int itemIndex
)
member IsItemHidden :
        view : View *
        itemIndex : int -> bool
Parameters
view View
 The view.
itemIndex Int32
 Item index in the Rebar Container.
Return Value
Boolean
 True if the RebarContainerItem is hidden in this view, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The item index is either less than 0 or graeter than or equal to number of items in this Rebar Container element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace